Homework2/rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

  def index
    #ratings/sortings
    @all_ratings = Movie.ratings.map { |rating| {name: rating, value: params[:ratings] ? params[:ratings].include?(rating) : true} }
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('{:name=>"G", :value=>true}', '{:name=>"PG", :value=>true}', '{:name=>"PG-13", :value=>true}', '{:name=>"R", :value=>true}')  ORDER BY release_date